/*
前端：.net php java/javascript (python html Css3)
项目经验积累：
Sqlite源码 Lua源码
面试前可以做一些小项目
比如音乐播放器
web服务器
语言解析器xml/markdown
windows驱动需求比较少，小厂设备一般用linux系统（因为是开源的）
mfc和Qt都是对win32封装
win32内核 MFC QT可能以后工作的时候用到也可能用不到，进公司的1-2个月会有老鸟来带你，
这时候是学习一大波知识的时候了，抓住这个机会，在实战中提升自己
应用程序QQ                     应用程序QQ
    |                               |
   内核                           内核
    |                               |
   硬件      TCP/IP协议通信        硬件  
    |-------------------------------|
百度、阿里现在的社招比较少了，最好有内推

学完c/c++/数据结构之后的工作重心可以转到写项目、写简历、刷面试题上面了

*/